{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "dd846df7",
   "metadata": {},
   "source": [
    "# Общая информация"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "390d24d4",
   "metadata": {},
   "source": [
    "Вам нужно помочь секретарю автоматизировать работу. Для этого нужно написать программу, которая будет на основе хранимых данных исполнять пользовательские команды.\n",
    "\n",
    "Общие требования к программе:\n",
    "\n",
    "* код должен быть грамотно декомпозирован (каждая функция отвечает за свою конкретную задачу, дублирующийся функционал переиспользуется, а его код не повторяется);\n",
    "* в коде отсутствуют глобальные переменные (за исключением documents и directories);\n",
    "* пользовательский ввод обрабатывается в цикле while до тех пор, пока пользователь явно не завершит программу (вводом команды \"q\")."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "id": "28cb9cb1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите команду: w\n",
      "Такой команды не существует\n",
      "Введите команду: p\n",
      "Введите номер документа: 10006\n",
      "Аристарх Павлов\n",
      "Введите команду: s\n",
      "Введите номер документа: 11-2\n",
      "Документ хранится на полке: 1\n",
      "Введите команду: ads\n",
      "Введите номер полки: 2\n",
      "Такая полка уже существует. Текущий список полок: \n",
      "1\n",
      "2\n",
      "3\n",
      "None\n",
      "Введите команду: ads\n",
      "Введите номер полки: 4\n",
      "Полка добавлена. Текущий список полок: \n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "None\n",
      "Введите команду: ds\n",
      "Введите номер полки: 2\n",
      "На полке есть документы, удалите их перед удалением полки. Текущий перечень полок: \n",
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "None\n",
      "Введите команду: ds\n",
      "Введите номер полки: 3\n",
      "Полка удалена. Текущий список полок: \n",
      "1\n",
      "2\n",
      "4\n",
      "None\n",
      "Введите команду: q\n",
      "Выполнение завершено\n"
     ]
    }
   ],
   "source": [
    "#перечень документов\n",
    "documents = [\n",
    " {'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'},\n",
    " {'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'},\n",
    " {'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'}\n",
    "]\n",
    "\n",
    "#перечень полок\n",
    "directories = {\n",
    " '1': ['2207 876234', '11-2'],\n",
    " '2': ['10006'],\n",
    " '3': []\n",
    "}\n",
    "\n",
    "# Задание 1\n",
    "\n",
    "def doc_owher(document, num): #Пункт 1  - найти владельца документа по номеру\n",
    "    for doc in document:\n",
    "        if doc.get('number') == num:\n",
    "            return doc.get('name')\n",
    "    return 'Документ не найден в базе'\n",
    "\n",
    "def number_directory(directory, number): #Пункт 2 - найти на какой полке документ по номеру\n",
    "    for key, value in directory.items():\n",
    "        if number in value:\n",
    "            return('Документ хранится на полке: '+key)\n",
    "    return 'Документ не найден в базе'\n",
    "   \n",
    "\n",
    "def full_info(document): #Пункт 3 - вывести все документы с полками\n",
    "    for doc in document:\n",
    "        print('№:'+ doc.get('number')+', тип: '+ doc.get('type')+', владелец: '+ doc.get('name')+ ' - ' +number_directory(directories, doc.get('number')))\n",
    "    \n",
    "        \n",
    "def direct_exist(directory, num_dir): # Полка существует\n",
    "    for key in directory:\n",
    "        if key == num_dir:\n",
    "            return True\n",
    "    return False\n",
    "        \n",
    "\n",
    "def add_directory (directory, num_dir): #Пункт 4 - добавить полку\n",
    "    if direct_exist(directory, num_dir) == False:\n",
    "        directory [num_dir] = []\n",
    "        print('Полка добавлена. Текущий список полок: ')\n",
    "    else: print('Такая полка уже существует. Текущий список полок: ')\n",
    "    for key in directory.keys():\n",
    "        print(key)\n",
    "\n",
    "\n",
    "def direct_empty(directory, num_dir): # Полка пустая\n",
    "    for key, value in directory.items():\n",
    "        if (key == num_dir) and (len(value) > 0):\n",
    "            return False\n",
    "    return True\n",
    "        \n",
    "def del_direct(directory, num_dir): #Пункт 5 - удалить полку\n",
    "    if direct_exist(directory, num_dir) == True:\n",
    "        if direct_empty(directory, num_dir) == True:\n",
    "            del directory[num_dir]\n",
    "            print('Полка удалена. Текущий список полок: ')\n",
    "        else: print('На полке есть документы, удалите их перед удалением полки. Текущий перечень полок: ')\n",
    "    else: print('Такой полки не существует. Текущий список полок: ')\n",
    "    \n",
    "    for key in directory.keys():\n",
    "        print(key)\n",
    "\n",
    "#Взаимодействие с пользователем        \n",
    "while True:\n",
    "    user_command = input(\"Введите команду: \")\n",
    "    if user_command == 'p': \n",
    "        num = input('Введите номер документа: ')\n",
    "        print(doc_owher(documents, num))\n",
    "    elif user_command == 's':\n",
    "        number = input('Введите номер документа: ')\n",
    "        print(number_directory(directories, number))\n",
    "    elif user_command == '/':\n",
    "        print(full_info(documents))\n",
    "    elif user_command == 'ads':\n",
    "        num_directory = input('Введите номер полки: ')\n",
    "        print(add_directory(directories, num_directory))\n",
    "    elif user_command == 'ds':\n",
    "        num_directory = input('Введите номер полки: ')\n",
    "        print(del_direct(directories, num_directory))\n",
    "    elif user_command == 'q': \n",
    "        print('Выполнение завершено')\n",
    "        break\n",
    "    else: print('Такой команды не существует')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bd5de9fa",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
